       01  fd-aluno.
           05  fd-aluno-nome                        pic  x(10).
           05  fd-aluno-serie                       pic  9(02).
           05  fd-aluno-cpf                         pic  x(12).
